Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition.Type Property
 The type of the input the current instance contains.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingPluginBase.InputDefinition.InputTypes Type { get; set; }
Public Property Type As DrawingPluginBase.InputDefinition.InputTypes
	Get
	Set
Property Value
Type: DrawingPluginBase.InputDefinition.InputTypes
See Also
Reference
DrawingPluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace